{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "flatten_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "name": "flatten_input"}, "inbound_nodes": []}, {"name": "flatten", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["flatten_input", 0, 0, {}]]]}, {"name": "dense", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"name": "dropout", "class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"name": "activation", "class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "lambda", "class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAGwBTACkBTqkAKQHaAXgpAdoIdGVtcFRlbXBy\nAQAAAPqWL1VzZXJzL2JsYWtlZWR3YXJkcy9Eb2N1bWVudHMvR29vZ2xlLURyaXZlL1VuaXZlcnNp\ndHktb2YtU291dGgtQ2Fyb2xpbmEvMm5kLXllYXIvUmVzZWFyY2gvSmFtc2hpZGktTGFiL1JlcG9z\nL25ldXJhbC1kaXN0aWxsZXIvRVBLRC9zcmMvU3R1ZGVudERlbnNlLnB52gg8bGFtYmRhPisAAABz\nAAAAAA==\n", null, [75]], "function_type": "lambda", "module": "StudentDense", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["activation", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["activation", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["lambda", 0, 0, {}]]]}, {"name": "concatenate", "class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["activation_1", 0, 0, {}], ["activation_2", 0, 0, {}]]]}], "input_layers": [["flatten_input", 0, 0]], "output_layers": [["concatenate", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}